authz_benchmark/jmeter_report/k8s_1ng_1j_3r_9600t_600e_4cpu_async2_https_http2_jdk17_zgc/h2load.out
starting benchmark...
spawning thread #0: 9600 total client(s). Timing-based test with 0s of warm-up time and 900s of main duration for measurements.
Warm-up started for thread #0.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 901.93s, 2876.35 req/s, 21.62MB/s
requests: 2588716 total, 2598316 started, 2588716 done, 2588716 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2588716 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 19.01GB (20407383895) total, 251.82MB (264049032) headers (space savings 32.00%), 18.67GB (20047016704) data
                     min         max         mean         sd        +/- sd
time for request:   156.97ms       6.75s       3.32s    185.81ms    90.18%
time for connect:   906.35ms       5.33s       3.00s       1.29s    57.55%
time to 1st byte:      4.53s      11.45s       6.35s       1.42s    63.74%
req/s           :       0.30        0.30        0.30        0.00    75.48%